IDENTIFICATION DIVISION.
PROGRAM-ID. LOW-DISK-SPACE.

* This program checks the disks in an OpenVMS system and displays
* a warning to the user for any disks that have less than 2GB
* of free space. It also sends an email using DECmail to all
* the users listed in the file "users.dat" with the same warning.

ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 DISK-NAME PIC X(20).
01 DISK-SPACE PIC 9(9)V9(9) COMP-3.
01 USER-NAME PIC X(20).

FILE-CONTROL.
SELECT USERS-FILE
  ASSIGN TO "USERS.DAT"
  ORGANIZATION IS LINE SEQUENTIAL.

PROCEDURE DIVISION.

BEGIN.

OPEN INPUT USERS-FILE

PERFORM UNTIL DISK-NAME = "STOP"
  ACCEPT DISK-NAME
  IF DISK-NAME = "STOP"
    EXIT PERFORM
  END-IF
  PERFORM VMS-CALL

  IF DISK-SPACE < 2
    DISPLAY "Please take action on " DISK-NAME " as it has " DISK-SPACE " GB remaining free."
    PERFORM SEND-EMAIL
  END-IF

SEND-EMAIL.
  READ USERS-FILE
  AT END MOVE "EOF" TO USER-NAME
  END-READ
  PERFORM UNTIL USER-NAME = "EOF"
    MOVE USER-NAME TO MAIL-FILE
    MOVE "Low disk space warning" TO SUBJECT
    MOVE MESSAGE-TEXT TO BODY
    CLOSE MAIL-FILE
    PERFORM SEND-MAIL
    READ USERS-FILE
    AT END MOVE "EOF" TO USER-NAME
    END-READ
  END-PERFORM
  EXIT.

VMS-CALL.
  PERFORM UNTIL VMS-RETURN-CODE = 0
    VMS SYSTEM-CALL
    VMS-RETURN-CODE
  END-PERFORM.

END PROGRAM LOW-DISK-SPACE.
