IDENTIFICATION DIVISION.
PROGRAM-ID. READ-FILE-TO-ARRAY.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT INFILE ASSIGN TO "input-file.txt"
   ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INFILE.
   01 INPUT-RECORD.
      02 INPUT-LINE PIC X(80).

WORKING-STORAGE SECTION.
   01 ARRAY-SIZE PIC 9(4) VALUE ZERO.
   01 ARRAY-MAX-SIZE PIC 9(4) VALUE 9999.
   01 ARRAY OCCURS 0 TO 9999 TIMES DEPENDING ON ARRAY-SIZE.
      02 ARRAY-LINE PIC X(80).

PROCEDURE DIVISION.
   OPEN INPUT INFILE.
   PERFORM UNTIL EOF(INFILE)
      READ INFILE
         AT END MOVE 'Y' TO END-OF-FILE
         NOT AT END ADD 1 TO ARRAY-SIZE
            IF ARRAY-SIZE > ARRAY-MAX-SIZE
               DISPLAY "ERROR: ARRAY IS FULL"
               STOP RUN
            END-IF
            MOVE INPUT-LINE TO ARRAY (ARRAY-SIZE).
   END-PERFORM.
   CLOSE INFILE.
